[{"html_name": "index.html", "description": "Main page showcasing the company's overview, latest news, and major highlights. It serves as the primary gateway to all the content and features of the company, providing users with comprehensive information about the action game company and its famous work, Black Myth Wukong.", "relationship": {"buttons": [{"button_name": "About Us", "jump_page": "about.html"}, {"button_name": "Research Projects", "jump_page": "research.html"}, {"button_name": "Collaboration", "jump_page": "collaboration.html"}, {"button_name": "Social Responsibility", "jump_page": "social_responsibility.html"}, {"button_name": "Join Us", "jump_page": "join_us.html"}, {"button_name": "Latest Updates", "jump_page": "updates.html"}, {"button_name": "Contact Us", "jump_page": "contact.html"}], "links": [{"link_name": "Game News", "jump_page": "news.html"}, {"link_name": "Game Awards", "jump_page": "awards.html"}, {"link_name": "Game Releases", "jump_page": "releases.html"}, {"link_name": "Black Myth Wukong Official Page", "jump_page": "black_myth_wukong.html"}]}, "practice_features": "Highlights the latest games, updates, and important news. Provides quick access to the company's various sections such as research projects, collaborations, and social responsibilities.", "additional_features": "Interactive media and game trailers. Background video showcasing gameplay. Sections for user testimonials and reviews. A dedicated section for Black Myth Wukong featuring high-resolution images and videos. Newsletter subscription form.", "is_main_page": true}, {"html_name": "about.html", "description": "Detailed information about the company, its mission, history, and key achievements. This page serves to give visitors a comprehensive understanding of the company's journey, values, and goals.", "relationship": {"buttons": [{"button_name": "Main Page", "jump_page": "index.html"}, {"button_name": "Our Games", "jump_page": "games.html"}, {"button_name": "Contact Us", "jump_page": "contact.html"}], "links": [{"link_name": "Careers", "jump_page": "careers.html"}, {"link_name": "Press", "jump_page": "press.html"}]}, "practice_features": "Company history, mission statement, team bios, and vision for the future.", "additional_features": "Timeline of significant events and milestones, interactive team member profiles with photos and biographies, a section dedicated to the company's awards and recognitions, and a video introduction from the CEO.", "is_main_page": false}, {"html_name": "research.html", "description": "This page provides an in-depth overview of the research projects and technological advancements undertaken by the action game company. It highlights innovative techniques, tools, and methodologies that drive the development of their famous work, Black Myth Wukong. Users can explore detailed descriptions, goals, and outcomes of each project.", "relationship": {"buttons": [{"button_name": "Main Page", "jump_page": "index.html"}, {"button_name": "Ongoing Projects", "jump_page": "ongoing_projects.html"}, {"button_name": "Completed Projects", "jump_page": "completed_projects.html"}, {"button_name": "Contact Team", "jump_page": "contact_team.html"}], "links": [{"link_name": "Black Myth Wukong", "jump_page": "black_myth_wukong.html"}]}, "practice_features": "Detailed descriptions of ongoing and completed research projects, including objectives, methodologies, and outcomes. Highlighted sections for key projects related to Black Myth Wukong.", "additional_features": "Interactive charts and graphs representing research data, video presentations of research findings, downloadable research papers, and a section for user feedback on research initiatives.", "is_main_page": false}, {"html_name": "collaboration.html", "description": "This page provides detailed information about collaboration opportunities and existing partnerships with the action game company behind 'Black Myth: Wukong'. It serves as a hub for potential partners to understand the benefits and processes of collaboration.", "relationship": {"buttons": [{"button_name": "Main Page", "jump_page": "index.html"}, {"button_name": "Contact Us", "jump_page": "contact.html"}, {"button_name": "Apply for Partnership", "action": "openPartnershipForm()"}], "links": [{"link_name": "About Us", "jump_page": "about.html"}, {"link_name": "Our Games", "jump_page": "games.html"}]}, "practice_features": "Detailed descriptions of partnership programs, collaboration opportunities, and application processes. Includes testimonials and case studies from successful past collaborations.", "additional_features": "Interactive map showing global partners, downloadable partnership application forms, video testimonials from existing partners, and a FAQ section addressing common questions about partnerships.", "is_main_page": false}, {"html_name": "social_responsibility.html", "description": "This page provides detailed information about the company's social responsibility initiatives and community involvement. It highlights the company's efforts in various social projects, environmental sustainability programs, and contributions to local and global communities.", "relationship": {"buttons": [{"button_name": "Main Page", "jump_page": "index.html"}, {"button_name": "Our Projects", "jump_page": "projects.html"}, {"button_name": "Contact Us", "jump_page": "contact.html"}, {"button_name": "Donate Now", "action": "openDonationForm()"}], "links": [{"link_name": "Environmental Initiatives", "jump_page": "environment.html"}, {"link_name": "Community Involvement", "jump_page": "community.html"}]}, "practice_features": "Information on social initiatives and community projects, detailed descriptions of ongoing and past projects, and the impact of these initiatives.", "additional_features": "Gallery of events, video testimonials from beneficiaries, interactive map showing project locations, donation form, and links to social media platforms for updates.", "is_main_page": false}, {"html_name": "join_us.html", "description": "Career opportunities and application process. This page provides detailed information on available job positions, the application process, and what it's like to work at the company. Users can explore job listings, learn about the company's culture, and read testimonials from current employees.", "relationship": {"buttons": [{"button_name": "Main Page", "jump_page": "index.html"}, {"button_name": "Apply Now", "action": "openApplicationForm()"}, {"button_name": "Contact HR", "action": "openContactForm()"}], "links": [{"link_name": "Employee Benefits", "jump_page": "benefits.html"}]}, "practice_features": "List of open positions with detailed descriptions, application forms, and submission options.", "additional_features": "Employee testimonials, company culture highlights, a section on employee benefits, and a FAQ section about the hiring process. Interactive elements like hover effects on job listings, and a dynamic filter to sort positions by department or location.", "is_main_page": false}, {"html_name": "news.html", "description": "The News page provides the latest updates, announcements, and insights about the company's action games, including Black Myth Wukong. It features a dynamic and engaging layout to keep fans informed and excited about upcoming releases and developments.", "relationship": {"buttons": [{"button_name": "Main Page", "jump_page": "index.html"}, {"button_name": "Previous News", "jump_page": "previous_news.html"}, {"button_name": "Next News", "jump_page": "next_news.html"}], "links": [{"link_name": "Game Features", "jump_page": "game_features.html"}, {"link_name": "Community", "jump_page": "community.html"}]}, "practice_features": "News articles, press releases, media coverage, and developer blogs.", "additional_features": "RSS feed for news updates, social media integration for sharing news, comment section for user interactions, and a search bar for finding specific news articles.", "is_main_page": false}, {"html_name": "awards.html", "description": "This page provides detailed information about the awards won by the company and its famous game, Black Myth Wukong. It includes descriptions of each award, the criteria for winning the awards, and the significance of these recognitions in the gaming industry. Users can explore the accolades through a visually engaging layout.", "relationship": {"buttons": [{"button_name": "Main Page", "jump_page": "index.html"}, {"button_name": "Previous Awards", "jump_page": "previous_awards.html"}, {"button_name": "Next Awards", "jump_page": "next_awards.html"}, {"button_name": "Contact Us", "jump_page": "contact.html"}], "links": []}, "practice_features": "List of awards and recognitions, detailed descriptions of each award, award criteria, and significance.", "additional_features": "Photos and videos from award ceremonies, interactive timeline of awards, user comments and testimonials, and social media sharing options.", "is_main_page": false}, {"html_name": "releases.html", "description": "This page provides comprehensive details about game releases and upcoming titles from the action game company. It features in-depth information about new and upcoming games, including their storylines, gameplay mechanics, and development updates.", "relationship": {"buttons": [{"button_name": "Main Page", "jump_page": "index.html"}, {"button_name": "Previous Releases", "jump_page": "previous_releases.html"}, {"button_name": "Upcoming Titles", "jump_page": "upcoming_titles.html"}, {"button_name": "Contact Us", "jump_page": "contact.html"}], "links": [{"link_name": "Official Black Myth Wukong Site", "jump_page": "black_myth_wukong.html"}]}, "practice_features": "Release dates, game descriptions, and trailers. Users can view detailed release notes and watch high-definition trailers directly on the page.", "additional_features": "Pre-order information, links to purchase, and a countdown timer for upcoming releases. Interactive elements such as hover effects on game covers and a dynamic filtering system to sort games by genre, release date, and popularity.", "is_main_page": false}]