[{"html_name": "index.html", "js_description": "JavaScript for interactive elements like the navigation bar, image carousel, and chat interface. The script also handles dynamic page transitions and enhances user engagement with animations.", "description": "The main page of the action game company, showcasing their recent achievements and popular games. A dedicated section highlights the 2024 TGA Game of the Year award for Black Myth Wukong. The page also features a dynamic chat interface with the virtual character Sun Wukong, allowing users to engage in real-time conversations.", "relationship": {"buttons": [{"button_name": "About Us", "jump_page": "about.html"}, {"button_name": "Games", "jump_page": "games.html"}, {"button_name": "Awards", "jump_page": "awards.html"}, {"button_name": "Contact", "jump_page": "contact.html"}, {"button_name": "Chat with Sun Wukong", "jump_page": "chat.html"}, {"button_name": "Latest News", "jump_page": "news.html"}], "links": [{"link_name": "Privacy Policy", "jump_page": "privacy.html"}, {"link_name": "Terms of Service", "jump_page": "terms.html"}], "imgs": [{"src": "img_0.png", "alt": "Hero battling a giant monster", "description": "Showcase of the game Black Myth Wukong"}, {"src": "img_1.png", "alt": "Crowd in city square", "description": "Major update announcement"}, {"src": "img_3.png", "alt": "City street with game advertisement", "description": "Advertisement of Black Myth Wukong"}, {"src": "img_23.png", "alt": "Award ceremony", "description": "Celebration of winning the 2024 TGA Game of the Year"}]}, "practice_features": "Responsive layout, SEO-friendly content, interactive chat interface, dynamic image carousel.", "additional_features": "Image carousel featuring game screenshots, chat interface with Sun Wukong, animated page transitions, real-time notifications about game updates and events.", "page_style": "Dark tone with a novel and stylish design. The layout is modern with a focus on immersive visuals and user engagement. High-contrast elements and sleek animations enhance the overall experience.", "is_main_page": true}, {"html_name": "about.html", "js_description": "JavaScript for content loading, team member introduction animations, and interactive company timeline.", "description": "Information about the company, its history, mission, and team. The page celebrates their recent win at the 2024 TGA Game of the Year for their famous work, Black Myth Wukong. It also features a dialogue chat interface where users can interact with the virtual character Sun Wukong.", "relationship": {"buttons": [{"button_name": "Home", "jump_page": "index.html"}, {"button_name": "Games", "jump_page": "games.html"}, {"button_name": "Chat with Sun Wukong", "action": "openChatInterface()"}], "links": [{"link_name": "Team", "jump_page": "team.html"}], "imgs": [{"src": "img_28.png", "alt": "Scientists in an advanced laboratory", "description": "Showcases the high-tech environment of the company"}, {"src": "img_15.png", "alt": "Modern office building", "description": "Depicts the company's headquarters"}, {"src": "img_0.png", "alt": "Hero battling a giant monster", "description": "Represents the epic adventures in the company's games, including Black Myth Wukong"}, {"src": "img_16.png", "alt": "Trophy with the inscription 'DALULO ACADEMY FELLOWSHIP AWARD'", "description": "Illustrates the company's recent achievement of winning the 2024 TGA Game of the Year"}]}, "practice_features": "Team member profiles, company timeline, interactive chat interface with Sun Wukong.", "additional_features": "Interactive company history timeline, animated transitions for team member introductions.", "page_style": "Professional and sleek with a dark tone, incorporating modern design elements and a novel aesthetic.", "is_main_page": false}, {"html_name": "games.html", "js_description": "JavaScript for game trailers, interactive game details, character bios, and gallery. Includes dynamic loading of game trailers and animations.", "description": "A page displaying the company's portfolio of games, with a prominent focus on their award-winning title, Black Myth Wukong. This page features interactive elements to explore game details, character bios, and action sequences.", "relationship": {"buttons": [{"button_name": "Home", "jump_page": "index.html"}, {"button_name": "About Us", "jump_page": "about.html"}, {"button_name": "Contact", "jump_page": "contact.html"}, {"button_name": "Shop", "jump_page": "shop.html"}], "links": [{"link_name": "Black Myth Wukong", "jump_page": "black_myth_wukong.html"}, {"link_name": "Game Awards 2024", "jump_page": "awards_2024.html"}], "imgs": [{"src": "img_0.png", "alt": "Hero battling a giant monster", "description": "Black Myth Wukong game cover, showing an epic battle scene with a hero and a giant monster at sunrise."}, {"src": "img_5.png", "alt": "Knight charging on battlefield", "description": "Action sequences from the game, depicting intense battles and heroic moments."}, {"src": "img_3.png", "alt": "Neon billboard announcing game update", "description": "A major update announcement for Black Myth Wukong, displayed on a huge neon billboard in a bustling city square."}]}, "practice_features": "Game trailers, character bios, galleries, purchase links, and dynamic loading of content.", "additional_features": "User reviews and ratings section, interactive character profiles, and live chat with virtual character Sun Wukong.", "page_style": "Dynamic and engaging with dark and intense visuals. The design incorporates high-contrast elements and smooth animations to enhance user experience.", "is_main_page": false}, {"html_name": "awards.html", "js_description": "JavaScript for showcasing awards and achievements with animations and dynamic content loading.", "description": "A page dedicated to the awards and recognitions the company has received, emphasizing their recent win at the 2024 TGA Game of the Year for Black Myth Wukong. The page includes detailed descriptions of each award, images, and videos of the ceremonies, all presented with sleek animations.", "relationship": {"buttons": [{"button_name": "Home", "jump_page": "index.html"}, {"button_name": "Games", "jump_page": "games.html"}, {"button_name": "About Us", "jump_page": "about_us.html"}, {"button_name": "Contact", "jump_page": "contact.html"}], "links": [{"link_name": "2024 TGA Game of the Year", "jump_page": "award_details.html"}, {"link_name": "Previous Awards", "jump_page": "previous_awards.html"}], "imgs": [{"src": "img_23.png", "alt": "Tech Academy Innovation Awards", "description": "Award ceremony image showcasing the company's recognition at the Tech Academy Innovation Awards."}, {"src": "img_16.png", "alt": "DALULO Academy Fellowship Award", "description": "Trophy image representing the DALULO Academy Fellowship Award."}, {"src": "img_0.png", "alt": "Hero battling a giant monster", "description": "An image from Black Myth Wukong, depicting a heroic battle scene, reflecting the game's epic nature and award-winning quality."}]}, "practice_features": "Award details, images, and dynamic content loading.", "additional_features": "Videos of award ceremonies, interactive animations, and a timeline of awards. Integration with social media for sharing achievements.", "page_style": "Elegant and celebratory with a dark theme, featuring gold accents and smooth transitions to highlight the prestigious nature of the awards.", "is_main_page": false}, {"html_name": "contact.html", "js_description": "JavaScript for form validation, interactive map, and chat interface with Sun Wukong.", "description": "Contact page featuring a form for inquiries, an interactive map showing the company's location, and a chat interface for real-time interaction with the virtual character Sun Wukong.", "relationship": {"buttons": [{"button_name": "Home", "jump_page": "index.html"}, {"button_name": "About Us", "jump_page": "about.html"}, {"button_name": "Submit", "action": "submitForm()"}], "links": [{"link_name": "Privacy Policy", "jump_page": "privacy.html"}, {"link_name": "Terms of Service", "jump_page": "terms.html"}], "imgs": [{"src": "img_45.png", "alt": "Volunteer registration form", "description": "Example of filling out forms"}, {"src": "img_48.png", "alt": "Golden Buddha statue", "description": "Decorative image for aesthetic"}, {"src": "img_0.png", "alt": "Hero battling a giant monster", "description": "Depiction of an epic battle scene, resonating with the action theme of the company"}]}, "practice_features": "Contact form, interactive map, real-time chat interface.", "additional_features": "Live chat support with Sun Wukong, animated form validation feedback, tooltips for form fields.", "page_style": "Novel and modern design with a dark, immersive background. The layout is clean, with the form on the left, the map on the right, and the chat interface on the bottom right corner.", "is_main_page": false}, {"html_name": "chat.html", "js_description": "JavaScript for the chat interface with Sun Wukong, including AI-driven responses and real-time voice interaction.", "description": "A chat interface page where users can interact with a virtual character, Sun Wukong. This page offers an immersive experience with advanced AI responses and real-time voice interaction, allowing users to engage deeply with the character in a dynamic and interactive environment.", "relationship": {"buttons": [{"button_name": "Home", "jump_page": "index.html"}, {"button_name": "Games", "jump_page": "games.html"}, {"button_name": "Help", "jump_page": "help.html"}], "links": [{"link_name": "Learn more about Sun Wukong", "jump_page": "sun_wukong.html"}, {"link_name": "Black Myth Wukong", "jump_page": "black_myth_wukong.html"}], "imgs": [{"src": "img_57.png", "alt": "Interconnected points and lines", "description": "Background image for chat interface, representing the interconnected nature of AI responses."}, {"src": "img_50.png", "alt": "Global and chat icon", "description": "Icon for chat feature, indicating the global reach and interactive capability of the chat interface."}, {"src": "img_0.png", "alt": "Hero battling a giant monster", "description": "A dynamic image representing the action-packed nature of Black Myth Wukong, enhancing the thematic experience of the chat page."}]}, "practice_features": "Interactive AI chat interface with real-time text and voice interaction.", "additional_features": "Voice interaction with Sun Wukong, animated character responses, and themed sound effects for a more engaging experience.", "page_style": "Futuristic and interactive with a dark tone, incorporating sleek animations and a responsive design to ensure a seamless user experience.", "is_main_page": false}, {"html_name": "privacy.html", "js_description": "JavaScript for collapsing sections and forms. Includes smooth transitions and animations for better user experience.", "description": "Privacy policy page detailing how user data is handled. This page provides comprehensive information on data collection, usage, and user rights. It is designed to be accessible and easy to navigate.", "relationship": {"buttons": [{"button_name": "Home", "jump_page": "index.html"}, {"button_name": "Contact", "jump_page": "contact.html"}, {"button_name": "Download PDF", "action": "downloadPDF('privacy_policy.pdf')"}, {"button_name": "Back to Top", "action": "scrollToTop()"}], "links": [{"link_name": "Read more", "jump_page": "privacy_details.html"}, {"link_name": "Terms of Service", "jump_page": "terms.html"}], "imgs": [{"src": "img_42.png", "alt": "Annual Social Responsibility Report", "description": "Emphasizes the company's commitment to privacy and data protection."}, {"src": "img_19.png", "alt": "Infographic displaying statistical data", "description": "Visual representation of privacy data, including user demographics and data usage."}, {"src": "img_57.png", "alt": "Complex network structure", "description": "A representation of the interconnected nature of data and privacy."}]}, "practice_features": "Collapsible sections for detailed information, making it easy for users to find specific details without overwhelming them with text.", "additional_features": "Downloadable PDF of the privacy policy, tooltips explaining key terms, and a search function to quickly locate information within the document.", "page_style": "Clear and concise with a dark background. The design includes smooth animations for collapsible sections and a modern, user-friendly interface.", "is_main_page": false}]